GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
			}
			
			if(gsm_socket[i].state == SOCKET_CONNECT)
			{
				if(gsm_socket[i].type=='u')
				{
					sprintf(buf,"AT%%IPOPENX=%d,\"UDP\",\"%s\",%d\r\n",i,gsm_socket[i].ip,gsm_socket[i].port);
				}
				else
				{
					sprintf(buf,"AT%%IPOPENX=%d,\"TCP\",\"%s\",%d\r\n",i,gsm_socket[i].ip,gsm_socket[i].port);
				}
				rt_kprintf("%08d gsm_send>%s", rt_tick_get( ),buf);
				m66_write( &dev_gsm, 0, buf, sizeof( buf ) );
				pt_timer_set( &timer_gsm_socket, RT_TICK_PER_SECOND * 35 );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( pt_resp_IPOPENX)));
				if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
					gsm_socket[i].state = SOCKET_CONNECT_ERR;
				}
				else
				{
					gsm_socket[i].state = SOCKET_READY;
					break;
				}
			}
				
		}
	}
	PT_END( pt );
}

#endif

static int protothread_gsm_socket( struct pt *pt )
{
	static char				buf[64];
	static uint8_t		i,j;
	static struct pt_timer timer_gsm_socket;

	PT_BEGIN( pt );
	if( gsm_state == GSM_AT )
	{
		for( i = 0; i < MAX_SOCKET_NUM; i++ )
		{
			if( gsm_socket[i].state == SOCKET_DNS )
			{
				for(j=0;j<4;j++)
				{
					sprintf( buf, "AT%%DNSR=\"%s\"\r\n", gsm_socket[i].domain_name );
					rt_kprintf("%08d gsm_send>%s", rt_tick_get( ),buf);
					m66_write( &dev_gsm, 0, buf, sizeof( buf ) );
					pt_timer_set( &timer_gsm_socket, RT_TICK_PER_SECOND * 5 );
					PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( pt_resp_DNSR ) ) );
					if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
					{
						rt_kprintf( "timeout\r\n" );
					}
					else
					{
						gsm_socket[i].state = SOCKET_CONNECT;
						break;
					}
				}
				if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
				{
					gsm_socket[i].state = SOCKET_DNS_ERR;
				}
				
			}
			
			if(gsm_socket[i].state == SOCKET_CONNECT)
			{
				if(gsm_socket[i].type=='u')
				{
					sprintf(buf,"AT%%IPOPENX=%d,\"UDP\",\"%s\",%d\r\n",i,gsm_socket[i].ip,gsm_socket[i].port);
				}
				else
				{
					sprintf(buf,"AT%%IPOPENX=%d,\"TCP\",\"%s\",%d\r\n",i,gsm_socket[i].ip,gsm_socket[i].port);
				}
				rt_kprintf("%08d gsm_send>%s", rt_tick_get( ),buf);
				m66_write( &dev_gsm, 0, buf, sizeof( buf ) );
				pt_timer_set( &timer_gsm_socket, RT_TICK_PER_SECOND * 35 );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_socket ) || ( RT_EOK == pt_resp( pt_resp_IPOPENX)));
				if( pt_timer_expired( &timer_gsm_socket ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
					gsm_socket[i].state = SOCKET_CONNECT_ERR;
				}
				else
				{
					gsm_socket[i].state = SOCKET_READY;
					break;
				}
			}
				
		}
	}
	PT_END( pt );
}





ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch;

	PT_INIT( &pt_gsm_power );
	PT_INIT( &pt_gsm_socket );

	while( 1 )
	{
		while( rt_ringbuffer_getchar( &rb_uart4_rx, &ch ) == 1 ) /*有数据时，保存数据*/
		{
			gsm_rx[gsm_rx_wr++] = ch;
			if( gsm_rx_wr == GSM_RX_SIZE )
			{
				gsm_rx_wr = 0;
			}
			gsm_rx[gsm_rx_wr] = 0;
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		protothread_gsm_power( &pt_gsm_power );
		protothread_gsm_socket( &pt_gsm_socket );
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );

	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

/*初始化串口接收缓冲区*/
	rt_ringbuffer_init( &rb_uart4_rx, uart4_rxbuf, UART4_RX_SIZE );

	rt_mb_init( &mb_gsmrx, "gsm_rx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}


/*控制gsm状态 0 查询*/
rt_err_t config_gsmstate( int cmd )
{
	if(cmd)	gsm_state = cmd;
	return gsm_state;
}

FINSH_FUNCTION_EXPORT( config_gsmstate, control gsm state );


/*apn信息设置,任何时候只有一个是有效的。不同于socket,可有多个同时激活*/
rt_err_t config_apn( char *apn, char *user, char *psw )
{
	dial_apn=apn;
	dial_user=user;
	dial_psw=psw;
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( config_apn, config apn );

/*
判断一个字符串是不是表示ip的str
如果由[0..9|.] 组成

'.' 0x2e
'/' 0x2f
'0' 0x30
'9' 0x39
简化一下。不判断 '/'
*/
static uint8_t is_ipstr(char * str)
{
	char *p=str;
	while(*p!=NULL)
	{
		if((*p>'9')||(*p<'.')) return 0;
		p++;
	}
	return 1;

}


/*
sock信息设置
判断ip_domain的类型
*/
rt_err_t config_sock( uint8_t linkno, char type,char *ip_domain,uint16_t port )
{
	gsm_socket[linkno].type = type;
	if(is_ipstr(ip_domain))
		strcpy(gsm_socket[linkno].ip,ip_domain);
	else
		gsm_socket[linkno].domain_name=ip_domain ;
	gsm_socket[linkno].port = port;
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( config_sock, config sock );

/*sock信息设置*/
rt_err_t sockstate( uint8_t linkno, T_SOCKET_STATE state)
{
	if(state) gsm_socket[linkno].state = state;
	return gsm_socket[linkno].state;
}

FINSH_FUNCTION_EXPORT( sockstate, control sock );

/*调试信息控制输出*/
rt_err_t dbgmsg( uint32_t i)
{
	if(i==0) rt_kprintf("debmsg=%d\r\n",fgsm_rawdata_out);
	else
		fgsm_rawdata_out=i;
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( dbgmsg, dbgmsg count );




/*发送AT命令*/
rt_size_t gsm_write( char *sinfo )
{
	return m66_write( &dev_gsm, 0, sinfo, strlen( sinfo ) );
}

FINSH_FUNCTION_EXPORT( gsm_write, write gsm );



#endif

/************************************** The End Of File **************************************/
